package com.ohgiraffers.section03.greedy;

/*
* Union & Find
* 집합 간의연산을 효율적으로 처리하기 위해 설계된 데이터 구조
* 특히 집합의 합집합(union)과 특정 원소가 속한 집합의 찾기(find)연산을 빠르게 처리하느데 유용하다.
* 집합은 서로 다른 원소들로 구성되며, 초기에는 각 원소가 독립적인 집합을 형성한다.
* */
public class E_UnionAndFind {


/*
    친구 관계
    학생들은 각각 고유한 번호로 식별되며, 주어진 친구 관계 쌍에 따라 학생들이 같은 그룹(친구 관계의 집합)에 속하는지 확인
    첫 번째 줄에 학생 수 N (1 <= N <= 1,000)과 친구 관계 쌍의 수 M (1 <= M <= 3,000)
    다음 M개의 줄에는 친구 관계를 나타내는 두 개의 정수
    마지막 줄에는 두 학생 x와 y
    두 학생 x와 y가 같은 그룹에 속하는지 확인하여 YES or NO 출력
*/
}
